/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   whatHappened.java                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aberry <aberry@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/09 14:36:02 by aberry            #+#    #+#             */
/*   Updated: 2021/03/09 14:36:02 by aberry           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Что произойдет, если привести числовое значение типа double к значению типа int,
которое больше самого большого значения типа int? Попробуйте сделать это.
 */

package ch01.ex05;

public class whatHappened {
    public static void main(String[] args) {
        double digit = 222147483650.01;
        int new_value = (int) digit;
        System.out.println(new_value);
    }
}

/*
Вывод: Кастуется максимальное значение инта
 */