/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   printAllASCII.java                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aberry <aberry@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/09 21:01:52 by aberry            #+#    #+#             */
/*   Updated: 2021/03/09 21:01:52 by aberry           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/**
 * Напишите программу, вводящую текстовую строку и выводящую все символы,
 * не представленные в коде ASCII, вместе с их значениями в Юникоде.
 */
package ch01.ex11;

public class printAllASCII {

    public static void main(String[] args) {
        for (int i = 0; i <= 65535; i++) {
            System.out.print((char) i + " ");
            if (i != 0 && i % 80 == 0) {
                System.out.println();
            }
        }
    }

}
